#+TITLE: Bash tests


#+BEGIN_SRC bash :results raw 
declare -A CACHE_DIR CACHE_RES CACHE_LOG TEST_DIR
# CACHE
CACHE_DIR=/home/erik/Repos/ass2/Final/cache
CACHE_RES=/home/erik/Repos/ass2/Final/cache/result.txt
CACHE_LOG=/home/erik/Repos/ass2/Final/cache/log.txt

TEST_DIR=/home/erik/Repos/ass2/Final/test

trshtool(){
    # > A multitool for cache handling
    case $1 in
	# Clean cache
	main) rm -r $CACHE_DIR && mkdir $CACHE_DIR    ;;
	# Create and clean log
	log) echo ""    > $CACHE_LOG                  ;;
	# Create and binary output 
	result) echo "" > $CACHE_RES                  ;;
	# Create a file in cache dir
	file) echo ""   > $CACHE_DIR/$2               ;;
	# Create a dir in cache dir
        dir) mkdir        $CACHE_DIR/$2               ;;
	# Move a cache file from cache to test dir
	get) cp           $CACHE_DIR/$2 $TEST_DIR/$2  ;;  
        ,*) perror $1 $2
	   return 1
    esac

    return 0
}
trshtool dir poggers
#+END_SRC

#+RESULTS:
examples.out
log.txt
logs
result.txt
examples.out
log.txt
result.txt
examples.out
log.txt
result.txt
OS error code   0:  Success
examples.out
log.txt
examples.out
log.txt
hej.txt
log
log.txt
memory_test_result
OPT
rtest.sh
test-out
test.txt
ui_test.sh
hej.txt
log
log.text
memory_test_result
OPT
rtest.sh
test-out
test.txt
ui_test.sh
hej.txt
log
log.txt
memory_test_result
OPT
rtest.sh
test-out
test.txt
ui_test.sh
